app/BaseModel.php

    public function getGallery($featuredIncluded = false)
    {
        $files = array();
        if (empty($this->gallery))
        {
            return [];
        }
        $list_item = [];
//        if ($featuredIncluded and $this->image_id) {
//            $list_item[] = [
//                'large' => FileHelper::url($this->image_id, 'full'),
//                'thumb' => FileHelper::url($this->image_id, 'thumb')
//            ];
//        }
        $items = explode(",", $this->gallery);
        foreach ($items as $k => $item) {
              array_push($files, MediaFile::find($item));
---
select * from `media_files` where `media_files`.`id` = '3575' and `media_files`.`deleted_at` is null limit 1